---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalElementStructuralRole
source: html/0c00a127-b19a-382c-384d-58f56ff512a0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalElementStructuralRole Property

"Structural Role": Used for Analytical Elements

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalElementStructuralRole { get; }
```